# 列表创建
l = []                      # []
l = [1,2,3] + [4,5,6]       # [1,2,3,4,5,6]
l = ['Hi'] * 3              # ['Hi','Hi','Hi']
l = list((1,2,3))           # [1, 2, 3]

# 列表切片
l = [1,2,3,4,5,6]
l[0:3]      # [1, 2, 3]
l[:3]       # [1, 2, 3]
l[-3:-1]    # [4, 5]              -1代表倒数第一个元素
l[-3:]      # [4, 5, 6]
l[0:10:2]   # [1, 3, 5]           2代表步长
l[:]        # [1, 2, 3, 4, 5, 6]  
l[::-1]     # [6, 5, 4, 3, 2, 1]  用于逆序

# 列表操作
l = [1,2,3]
l.append(4)     # [1, 2, 3, 4]     末尾追加元素      
l.insert(0, -1) # [-1, 1, 2, 3, 4] 将元素插入指定位置
l.pop()         # [-1, 1, 2, 3]    移除末尾元素，返回4
l.pop(0)        # [1, 2, 3]        移除指定位置元素，返回-1
l.remove(1)     # [2, 3]           移除指定元素的第一个匹配项
l.extend([4,5]) # [2, 3, 4, 5]     用新列表扩展原列表
l.reverse()     # [5, 4, 3, 2]     反向列表中元素  
l.sort()        # [2, 3, 4, 5]     对列表进行排序       
l.count(2)      # 1 返回指定元素出现次数
l.index(2)      # 0 返回第一个匹配项的索引

# 列表表达式
[i*i for i in range(10) if i%2]    # [1, 9, 25, 49, 81]
[m+n for m in 'AB' for n in 'XY']  # ['AX', 'AY', 'BX', 'BY']