# 集合操作
s = {'A', 'B'} 
s.add('CD')    # {'B', 'A', 'CD'}           添加整体
s.update('CD') # {'B', 'C', 'D', 'A', 'CD'} 添加每个元素
s.remove('CD') # {'B', 'C', 'D', 'A'}       移除元素

s2 = {'A', 'D'}
s & s2         # {'D', 'A'}           交集 
s | s2         # {'B', 'C', 'D', 'A'} 并集 
s - s2         # {'B', 'C'}           差集 

# 集合推导式
s = {x*x for x in range(5)}  # {0, 1, 4, 9, 16}

# 元组创建
t = ()                # ()
t = (50,)             # (50,)
tuple([1,2])          # (1, 2) 将列表转换为元组   
tuple({1:'A', 2:'B'}) # (1, 2) 传入字典返回key的元组